# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
# https://drive.google.com/file/d/1sPAwzRiRs0xYN699s8KpcZPNsYm2G7qt/view?usp=sharing

number_letter = int(input('Ввидите номер буквы: '))
print(chr(number_letter))
